fio_test/log/128k/128k_rand_randrw_30job_QD1.log
libpmem: (g=0): rw=randrw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 30 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=30): err= 0: pid=47068: Fri Mar  5 10:49:32 2021
  read: IOPS=40.2k, BW=5030MiB/s (5274MB/s)(1474GiB/300002msec)
    clat (usec): min=25, max=2935, avg=86.01, stdev=100.59
     lat (usec): min=25, max=2935, avg=86.13, stdev=100.65
    clat percentiles (usec):
     |  1.00th=[   32],  5.00th=[   34], 10.00th=[   34], 20.00th=[   36],
     | 30.00th=[   37], 40.00th=[   38], 50.00th=[   39], 60.00th=[   40],
     | 70.00th=[   43], 80.00th=[   94], 90.00th=[  281], 95.00th=[  326],
     | 99.00th=[  388], 99.50th=[  408], 99.90th=[  453], 99.95th=[  474],
     | 99.99th=[  562]
   bw (  MiB/s): min= 3309, max= 5797, per=100.00%, avg=5034.62, stdev= 8.86, samples=17940
   iops        : min=26477, max=46373, avg=40270.33, stdev=70.91, samples=17940
  write: IOPS=40.2k, BW=5031MiB/s (5275MB/s)(1474GiB/300002msec); 0 zone resets
    clat (usec): min=72, max=3603, avg=649.90, stdev=237.36
     lat (usec): min=72, max=3603, avg=651.08, stdev=237.93
    clat percentiles (usec):
     |  1.00th=[  408],  5.00th=[  441], 10.00th=[  461], 20.00th=[  490],
     | 30.00th=[  510], 40.00th=[  529], 50.00th=[  553], 60.00th=[  578],
     | 70.00th=[  627], 80.00th=[  865], 90.00th=[ 1045], 95.00th=[ 1156],
     | 99.00th=[ 1385], 99.50th=[ 1467], 99.90th=[ 1631], 99.95th=[ 1696],
     | 99.99th=[ 1811]
   bw (  MiB/s): min= 3331, max= 5162, per=100.00%, avg=5035.26, stdev= 3.50, samples=17940
   iops        : min=26647, max=41292, avg=40275.41, stdev=27.99, samples=17940
  lat (usec)   : 50=38.48%, 100=1.57%, 250=3.24%, 500=19.36%, 750=25.90%
  lat (usec)   : 1000=5.15%
  lat (msec)   : 2=6.28%, 4=0.01%
  cpu          : usr=99.70%, sys=0.05%, ctx=5211, majf=0, minf=92144
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=12071734,12073282,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5030MiB/s (5274MB/s), 5030MiB/s-5030MiB/s (5274MB/s-5274MB/s), io=1474GiB (1582GB), run=300002-300002msec
  WRITE: bw=5031MiB/s (5275MB/s), 5031MiB/s-5031MiB/s (5275MB/s-5275MB/s), io=1474GiB (1582GB), run=300002-300002msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%