fio_test/log/128k/128k_rand_randrw_6job_QD1.log
libpmem: (g=0): rw=randrw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 6 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=6): err= 0: pid=45984: Fri Mar  5 09:31:43 2021
  read: IOPS=44.6k, BW=5576MiB/s (5847MB/s)(1634GiB/300001msec)
    clat (usec): min=10, max=155, avg=34.11, stdev= 2.08
     lat (usec): min=10, max=155, avg=34.14, stdev= 2.08
    clat percentiles (nsec):
     |  1.00th=[29824],  5.00th=[30848], 10.00th=[31616], 20.00th=[32384],
     | 30.00th=[33024], 40.00th=[33536], 50.00th=[34048], 60.00th=[34560],
     | 70.00th=[35072], 80.00th=[35584], 90.00th=[36608], 95.00th=[37632],
     | 99.00th=[39168], 99.50th=[39680], 99.90th=[41728], 99.95th=[47872],
     | 99.99th=[64768]
   bw (  MiB/s): min= 4674, max= 5866, per=100.00%, avg=5583.77, stdev=17.02, samples=3594
   iops        : min=37397, max=46928, avg=44670.17, stdev=136.17, samples=3594
  write: IOPS=44.6k, BW=5575MiB/s (5845MB/s)(1633GiB/300001msec); 0 zone resets
    clat (usec): min=69, max=442, avg=97.94, stdev=11.11
     lat (usec): min=70, max=443, avg=98.61, stdev=11.11
    clat percentiles (usec):
     |  1.00th=[   80],  5.00th=[   83], 10.00th=[   85], 20.00th=[   89],
     | 30.00th=[   91], 40.00th=[   94], 50.00th=[   97], 60.00th=[  100],
     | 70.00th=[  103], 80.00th=[  108], 90.00th=[  114], 95.00th=[  119],
     | 99.00th=[  130], 99.50th=[  135], 99.90th=[  145], 99.95th=[  149],
     | 99.99th=[  159]
   bw (  MiB/s): min= 4745, max= 5688, per=100.00%, avg=5582.41, stdev= 8.10, samples=3594
   iops        : min=37963, max=45510, avg=44659.27, stdev=64.79, samples=3594
  lat (usec)   : 20=0.01%, 50=49.98%, 100=30.84%, 250=19.17%, 500=0.01%
  cpu          : usr=99.88%, sys=0.01%, ctx=507, majf=0, minf=18346
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=13382165,13378953,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5576MiB/s (5847MB/s), 5576MiB/s-5576MiB/s (5847MB/s-5847MB/s), io=1634GiB (1754GB), run=300001-300001msec
  WRITE: bw=5575MiB/s (5845MB/s), 5575MiB/s-5575MiB/s (5845MB/s-5845MB/s), io=1633GiB (1754GB), run=300001-300001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%