fio_test/log/128k/128k_seq_read_14job_QD1.log
libpmem: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 14 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=14): err= 0: pid=38574: Fri Mar  5 01:00:42 2021
  read: IOPS=394k, BW=48.1GiB/s (51.7GB/s)(14.1TiB/300002msec)
    clat (usec): min=25, max=1550, avg=35.02, stdev= 1.72
     lat (usec): min=25, max=1550, avg=35.04, stdev= 1.72
    clat percentiles (nsec):
     |  1.00th=[33024],  5.00th=[33536], 10.00th=[33536], 20.00th=[34048],
     | 30.00th=[34048], 40.00th=[34560], 50.00th=[34560], 60.00th=[35072],
     | 70.00th=[35584], 80.00th=[36096], 90.00th=[36608], 95.00th=[37632],
     | 99.00th=[41216], 99.50th=[42752], 99.90th=[47360], 99.95th=[49920],
     | 99.99th=[63232]
   bw (  MiB/s): min=39081, max=49491, per=100.00%, avg=49337.07, stdev=50.22, samples=8386
   iops        : min=312642, max=395930, avg=394696.48, stdev=401.81, samples=8386
  lat (usec)   : 50=99.95%, 100=0.05%, 250=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=99.84%, sys=0.01%, ctx=1196, majf=0, minf=29120
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=118223545,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=48.1GiB/s (51.7GB/s), 48.1GiB/s-48.1GiB/s (51.7GB/s-51.7GB/s), io=14.1TiB (15.5TB), run=300002-300002msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%