fio_test/log/128k/128k_seq_read_22job_QD1.log
libpmem: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libpmem, iodepth=1
...
fio-3.20
Starting 22 threads
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
libpmem: Laying out IO file (1 file / 4096MiB)
[...]

libpmem: (groupid=0, jobs=22): err= 0: pid=38943: Fri Mar  5 01:25:53 2021
  read: IOPS=401k, BW=49.0GiB/s (52.6GB/s)(14.4TiB/300002msec)
    clat (usec): min=25, max=2633, avg=53.89, stdev= 3.90
     lat (usec): min=25, max=2633, avg=53.92, stdev= 3.90
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   50], 10.00th=[   50], 20.00th=[   51],
     | 30.00th=[   52], 40.00th=[   53], 50.00th=[   53], 60.00th=[   55],
     | 70.00th=[   56], 80.00th=[   57], 90.00th=[   59], 95.00th=[   61],
     | 99.00th=[   67], 99.50th=[   69], 99.90th=[   79], 99.95th=[   85],
     | 99.99th=[  112]
   bw (  MiB/s): min=38460, max=50507, per=100.00%, avg=50272.15, stdev=44.61, samples=13156
   iops        : min=307677, max=404062, avg=402177.12, stdev=356.85, samples=13156
  lat (usec)   : 50=8.74%, 100=91.24%, 250=0.02%, 500=0.01%, 750=0.01%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=99.83%, sys=0.02%, ctx=4365, majf=0, minf=45760
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=120449586,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=49.0GiB/s (52.6GB/s), 49.0GiB/s-49.0GiB/s (52.6GB/s-52.6GB/s), io=14.4TiB (15.8TB), run=300002-300002msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%